import math
from 元神属性点数与属性百分比对应表 import 元神属性点数与属性百分比对应表


def 计算每级增加点数(成长):
    if 成长 <= 5:
        return 成长 ** 2 / 2
    else:
        return 12.5 + 2.5 * (成长 - 5)


def 计算元神属性(form):
    融合材料元神最高等级 = [9, 19, 29, 39, 49, 59, 69, 74, 79, 84]

    if form['已知初始条件'] == '已知初始点数':
        初始点数 = float(form['初始点数'])
    elif form['已知初始条件'] == '已知当前黄字点数':
        当前黄字点数 = float(form['当前黄字点数'])
        当前等级 = int(form['当前等级'])
        当前成长 = float(form['当前成长'])
        初始点数 = 当前黄字点数 - 计算每级增加点数(当前成长) * (当前等级 - 1)

    等级 = int(form['等级'])
    成长 = float(form['成长'])
    融合点数 = float(form['融合点数'])

    黄字点数 = 初始点数 + 计算每级增加点数(成长) * (等级 - 1)
    绿字点数 = 5 * (等级 - 1) + 融合点数
    百分比 = 元神属性点数与属性百分比对应表[int(math.floor(黄字点数 + 绿字点数))]

    融合后增加点数 = [(初始点数 + 计算每级增加点数(成长) * (融合材料元神等级 - 1) + 5 * (融合材料元神等级 - 1)) / 20 for 融合材料元神等级 in 融合材料元神最高等级]

    return {'黄字点数': 黄字点数, '绿字点数': 绿字点数, '百分比': 百分比, '融合后增加点数': 融合后增加点数}
